/* Status text for queued multi-part archives */
"%@ (+%d more)" = "%1$@ (mais %2$d)";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the file \"%@\" from the archive \"%@\": %@" = "Não foi possível extrair \"%1$@\" do arquivo \"%2$@\": %3$@";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the resource fork for the file \"%@\" from the archive \"%@\":\n%@" = "Não foi possível extrair a bifurcação de recursos de \"%1$@\" do arquivo \"%2$@\":\n%3$@";

/* Option in the password encoding pop-up to use the default encoding */
"Default encoding" = "Cifragem padrão";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Detetar automaticamente";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Extrair";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Extrair arquivo";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "A extrair \"%@\"";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "A preparar a extração de \"%@\"";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Selecionar";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "Selecione os ficheiros a descomprimir";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "Não foi possível extrair o conteúdo de \"%@\" com o The Unarchiver.";

/* Error message when encountering an error while extracting entries */
"There was a problem while extracting the contents of the file \"%@\": %@" = "Ocorreu um problema ao extrair o conteúdo de \"%1$@\": %2$@";

/* Error message when encountering an error while parsing an archive */
"There was a problem while reading the contents of the file \"%@\": %@" = "Ocorreu um problema ao ler o conteúdo de \"%1$@\": %2$@";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "Descomprimir";

/* Status text when asking for a password */
"You need to supply a password to open the archive \"%@\"." = "Forneça a palavra-passe para abrir o arquivo \"%@\".";

/* Title for nagging alert on first startup */
"Where should The Unarchiver extract archives?" = "Para onde deve o The Unarchiver extrair os arquivos?";

/* Content of nagging alert on first startup */
"Would you like The Unarchiver to extract archives to the same folder as the archive file, or would you prefer to be asked for a destination folder for every individual archive?" = "Extraia sempre para a mesma pasta ou faça com que a aplicação solicite sempre uma pasta de destino.";

/* Button to ask every time in nagging alert on first startup */
"Ask every time" = "Solicitar sempre";

/* Button to extract to the same folder in nagging alert on first startup */
"Extract to the same folder" = "Extrair para a mesma pasta";

/* Informative text in the file panel shown when trying to gain sandbox access */
"The Unarchiver does not have permission to write to this folder. To allow The Unarchiver to write to this folder, simply click \"Extract\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "O The Unarchiver precisa de autorização para guardar os elementos extraídos na pasta selecionada. Clique em \"Extrair\" para aprovar esta ação.";

/* Informative text in the file panel shown when trying to gain sandbox access for multi-part archives */
"The Unarchiver needs to search for more parts of this archive, but does not have permission to read the folder. To allow The Unarchiver to search in this folder, simply click \"Search\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "O The Unarchiver precisa de autorização para pesquisar outras partes do arquivo selecionado neste local. Clique em \"Pesquisar\" para aprovar esta ação.";

/* Panel OK button title when searching for more archive parts */
"Search" = "Pesquisar";

/* Check for updates menu item */
"Check for Updates…" = "Procurar atualizações…";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */
/* Common errors */

"Attempted to read more data than was available" = "O arquivo está incompleto";
"Opening file failed" = "Não foi possível abrir o ficheiro";
"Missing or wrong password" = "A palavra-passe fornecida está incorreta";
"Wrong checksum" = "O arquivo está corrompido";
"Could not create directory" = "Não foi possível criar a pasta";

/* Uncommon or unused errors */
"Unknown error" = "Erro desconhecido";
"Failed to write to file" = "Falha na escrita do ficheiro";
"Function called with illegal parameters" = "Função chamada com parâmetros não permitidos";
"Not enough memory available" = "Não existe memória disponível suficiente";
"Data is corrupted" = "Os dados estão corrompidos";
"File is not fully supported" = "O ficheiro não é totalmente compatível";
"Required resource missing" = "Recurso necessário em falta";
"Error on decrunching" = "Erro ao descodificar";
"Unknown file type" = "Tipo de ficheiro desconhecido";
"File, disk has been skipped" = "Ficheiro ou disco ignorado";
"User cancelled extraction" = "Extração cancelada pelo utilizador";
"File already exists" = "O ficheiro já existe";
"Verify failed (disk hook)" = "A verificação falhou (hook de disco)";
"Wrong drive geometry" = "Geometria da unidade errada";
"Unknown data format" = "Formato de dados desconhecido";
"Source contains no files" = "A fonte não contém ficheiros";
"Unknown filesystem" = "Sistema de ficheiros desconhecido";
"Name of file exists as directory" = "O nome do elemento já existe como diretório";
"Buffer was too short" = "O buffer é demasiado curto";
"Text encoding was defective" = "A cifragem de texto está defeituosa";
"Could not create symlink" = "Não foi possível criar a hiperligação simbólica";

"AlertTitle_SetFileTypeAssociationAppStore" = "Pode definir o The Unarchiver como a aplicação padrão para os tipos de ficheiro selecionados.";
"AlertDescription_SetFileTypeAssociationAppStore" = "Clique em \"Informações\" no menu contextual de um ficheiro e, depois, selecione The Unarchiver na lista \"Abrir com:\". Clique em \"Alterar todos…\" para aplicar essa alteração a todos os arquivos do mesmo tipo.";

"AlertTitle_UnsetFileTypeAssociationAppStore" = "Pode definir outra aplicação como aplicação padrão para os tipos de arquivo selecionados.";
"AlertDescription_UnsetFileTypeAssociationAppStore" = "Clique em \"Informações\" no menu contextual de um ficheiro e, depois, selecione a aplicação pretendida na lista \"Abrir com:\". Clique em \"Alterar todos…\" para aplicar essa alteração a todos os arquivos do mesmo tipo.";

/* About window */
"Standalone" = "Independente";

/* Extracted view */
"extracted" = "extraído";
